[
    {
        "id": "Pixel Art",
        "location": "pixel-art/index.html",
        "about": "Project Description<br></br>The <b>Pixel Art Creator</b> is an interactive web application that allows users to create pixel art drawings in a simple and fun way. With a custom color palette, adjustable pixel canvas, and options to clear and fill with random colors, this captivating tool is perfect for art and retro game enthusiasts.",
        "technology": "The Pixel Art Creator is developed using standard web technologies, including:<br></br>HTML5: Responsible for the page structure and the creation of elements such as buttons, input fields, and containers for the pixel canvas and color palette.<br></br>CSS3: Used to style the page elements, defining colors, borders, margins, sizes, and alignment of elements. CSS is also responsible for making the application responsive and user-friendly on different devices.<br></br>JavaScript: The programming language responsible for the interactivity and functionality of the application. JavaScript manipulates the DOM to respond to user click events, change styles, create and remove elements dynamically, and save and load drawings in local storage.",
        "howToUse": "When you access the page, you are greeted with a clean and user-friendly drawing interface. The color palette is displayed at the top, allowing you to choose the desired color for filling pixels. Below the palette, there are buttons to clear the canvas and generate random colors.<br></br>The pixel canvas is displayed in the center of the page, initially generated with the standard size of 5x5. You can change the canvas size by entering a new value in the <b>Canvas Size</b> field and clicking the <b>Resize</b> button.<br></br>To create a drawing, simply select a color from the palette and click on the desired pixels on the canvas. Pixels filled with the chosen color are automatically saved in local storage, allowing you to continue your drawing at any time.<br></br>The <b>Clear</b> button removes all colors from the canvas, allowing you to start a new drawing without reloading the page.<br></br>The <b>Random Colors</b> button fills the palette with new random colors, adding an extra dose of fun and creativity to the drawing process.",
        "resources": "Custom Color Palette: The application features a color palette with four initial options (blue, red, green, and yellow). Users can select a color from the palette by simply clicking on it. The selected color is used to fill the pixels on the canvas.<br></br>Adjustable Pixel Canvas: Users can set the size of the pixel canvas through a numeric input field. The minimum size is 5x5, and the maximum is 50x50. The pixel canvas is dynamically generated based on the entered value, providing a customized drawing screen for each user.<br></br>Clearing the Canvas: The application offers the option to clear the entire canvas, restoring it to its initial state, allowing users to start a new drawing at any time.<br></br>Random Colors: In addition to the fixed color palette, users can click a button to fill the palette with random shades. This allows for experimentation and the creation of more creative and diverse drawings.<br></br>Saving and Loading Drawings: User-created drawings are automatically saved in the browser's local storage. This allows users to resume work on a previous drawing when they revisit the page, ensuring that no progress is lost."
    },
    {
        "id": "Color Guess",
        "location": "color-guess/index.html",
        "about": "Project Description<br></br>The <b>Color Guess</b> project is a fun interactive game developed in standard web languages (HTML, CSS, and JavaScript) that challenges players to identify the corresponding RGB color from a palette of colored circles. The goal is to guess the correct color to accumulate points and achieve the highest score possible.",
        "technology": "HTML: Used to create the page structure, define elements and containers for the game title, palette of colored circles, hint text with the RGB value to be guessed, score display, and restart button.<br></br>CSS: Responsible for styling the page elements, defining colors, sizes, borders, and element positioning. CSS also creates the visual appearance of the colored circles and the restart button.<br></br>JavaScript: The programming language that provides interactivity and functionality to the game. JavaScript is responsible for generating random RGB colors for the colored circles, allowing the player to click on circles to guess the correct color, updating the score, and restarting the game.",
        "howToUse": "When the page loads, the application checks for a saved score in local storage. If none exists, the score is initialized to zero. The palette of colored circles is dynamically created, filling six circles with random RGB colors.<br></br>The objective of the game is to identify the circle whose color matches the RGB value displayed above the palette. When a player clicks on a circle, the application checks if the circle's color matches the displayed color. If the player is correct, the score is updated, and the <b>Correct!</b> message is displayed. Otherwise, the <b>Wrong! Try again!</b> message is shown.<br></br>The game continues until the player decides to restart by clicking the <b>Restart</b> button. Clicking the button reloads the page, generating new random RGB colors in the palette and resetting the score to zero.",
        "resources": "User-Friendly Interface: Upon accessing the application, players are greeted with a simple and appealing interface. The title <b>Color Guess</b> and a description guide players on the game's objective.<br></br>Palette of Colored Circles: The palette displays six colored circles, each with a random RGB color. Players must choose the circle with the color that matches the RGB value displayed above the palette.<br></br>Score Display: The application shows a score indicating the player's current score. Each correct guess adds 3 points to the score, encouraging players to continue trying to improve their performance.<br></br>Restart the Game: A <b>Restart</b> button is provided to allow players to start a new game, resetting the palette with new RGB values and the score to zero.<br></br>Local Storage: The score is saved locally so that players can track their progress, even after reloading the page or closing the browser."
    },
    {
        "id": "Meme Generator",
        "location": "meme-generator/index.html",
        "about": "Project Description<br></br>The <b>Meme Generator</b> project is a web application that allows users to create custom memes by combining images and text. The simple and intuitive interface allows users to select a pre-loaded image or upload their own image. Additionally, they can type text to add to the meme image, with a limit of up to 60 characters.",
        "technology": "HTML: The page structure is created using HTML markup language.<br></br>CSS: Stylesheets define the appearance and layout of the application.<br></br>JavaScript: The programming language provides interactivity and dynamic functionality to the page.<br></br>JSON: Data format used to store information about pre-loaded memes.",
        "howToUse": "Open the page, and you'll see the Meme Generator interface, which has the following sections:<br></br>Header: The header displays the title <b>Meme Generator</b>.<br></br>Main Area: The main area contains the actual Meme Generator, with a section for the meme image, an upload field to select an image, a field to type meme text, and a series of thematic buttons.<br></br>Pre-Loaded Images: Just below the text field, there's a selection of four pre-loaded images to create memes.<br></br>Save Button: At the bottom of the page, there's a <b>Save</b> button that allows you to save the generated meme to your device.<br></br>Create the Meme:<br></br>Select an Image: To begin, click the <b>Choose File</b> or <b>Select an Image</b> button (or similar, depending on your browser) in the image upload field. Select an image from your computer to use as the base for the meme. After selecting the image, it will be displayed in the meme area.<br></br>Add Text: Type the text you want to add to the meme in the <b>Type meme text</b> field just below the image upload field. Remember that the text should be up to 60 characters long. As you type, the text will be overlaid on the meme image in the preview area.<br></br>Choose Thematic Style (Optional): Below the text field, there are three thematic buttons with the themes <b>Fire</b>, <b>Water</b>, and <b>Earth</b>. Click one of these buttons to change the meme's style with colors and elements associated with the selected theme.<br></br>Preview and Save the Meme:<br></br>Preview the Meme: As you add text and choose a thematic style (optional), the meme image is updated in real-time in the preview area above the thematic buttons. This allows you to see how the meme will look before saving it.<br></br>Save the Meme: After creating the meme as desired, click the <b>Save</b> button located at the bottom of the page. The generated meme will be saved on your device. The location where the meme is saved depends on your browser's settings.<br></br>Share the Meme (Optional): With the meme saved on your device, you can share it with friends or on social media if you wish.",
        "resources": "Image Upload: Users can select a pre-loaded image or upload their own image to use as the base of the meme.<br></br>Text Addition: Users have the option to add text to the meme, with a limit of up to 60 characters.<br></br>Choice of Styles: There are three thematic buttons (<b>Fire</b>, <b>Water</b>, and <b>Earth</b>) that change the meme's style with colors and elements associated with the selected theme.<br></br>Real-Time Preview: As users enter text or choose a theme, the meme image is updated in real-time so you can see the result immediately.<br></br>Save Meme: Users have the option to save the current state of the meme list locally, which allows them to recover their memes after closing and reopening the application.<br></br>Responsive Design: The project uses responsive design techniques to adapt to different screen sizes and devices, ensuring a consistent user experience on computers, tablets, and smartphones."
    },
    {
        "id": "Todo List",
        "location": "todo-list/index.html",
        "about": "Project Description<br></br>The <b>Todo List</b> project is a web application. It offers a simple and intuitive interface for creating and managing task lists. The project's goal is to allow users to organize their tasks efficiently by marking tasks as complete and keeping track of their daily activities.",
        "technology": "HTML: The page structure is created using the HTML markup language.<br></br>CSS: The style and appearance of the application are defined using CSS styling language.<br></br>JavaScript: The interaction logic of the application is implemented using JavaScript, making the application dynamic and interactive.",
        "howToUse": "Enter the text of a new task in the <b>Enter your new task</b> input field.<br></br>Click the <b>Add Task</b> button to insert the task into the list.<br></br>Double-click on a task to mark it as complete. Click again to unmark it.<br></br>Use the provided buttons to delete tasks, remove completed tasks, remove the selected task, or rearrange the order of tasks in the list.<br></br>Your tasks will be automatically saved in the browser's local storage when you click the <b>Save Tasks</b> button. This allows you to resume your tasks the next time you access the project.",
        "resources": "Add Task: Users can type the text of a new task in the input field and click the <b>Add Task</b> button to insert it into the list.<br></br>Mark Task as Complete: Users can double-click on a task to mark it as complete. Completed tasks will be displayed with a line through the text.<br></br>Delete Tasks: There are three buttons that allow users to delete listed tasks - <b>Delete tasks</b>, <b>Delete completed tasks</b>, and <b>Remove selected</b>. The first one deletes all tasks from the list, the second one removes tasks marked as complete, and the third one removes the selected task.<br></br>Move Tasks: There are two buttons called <b>Move up</b> and <b>Move down</b> that allow users to rearrange the order of tasks in the list by moving a selected task up or down.<br></br>Save Tasks: By clicking the <b>Save Tasks</b> button, the current state of the task list is saved in the browser's local storage, allowing users to retrieve their tasks after closing and reopening the application.<br></br>Responsive Style: The project uses responsive design techniques to adapt to different screen sizes and devices, ensuring a consistent user experience on computers, tablets, and smartphones."
    }
]
