[
    {
        "id": "Pixel Art",
        "location": "pixel-art/index.html",
        "about": "Descrição do Projeto<br></br> O Pixel Art Creator é uma aplicação web interativa que permite aos usuários criar desenhos em estilo de pixel art de forma simples e divertida. Com uma paleta de cores personalizada, quadro de pixels ajustável e opções para limpar e preencher com cores aleatórias, esta ferramenta cativante é perfeita para entusiastas de arte e jogos retrô.",
        "technology": "O Pixel Art Creator é desenvolvido com tecnologias web padrão, incluindo:<br></br> HTML5: Responsável pela estrutura da página e criação de elementos como botões, campos de entrada e contêineres para o quadro de pixels e paleta de cores.<br></br> CSS3: Utilizado para estilizar os elementos da página, definindo cores, bordas, margens, tamanhos e alinhamento dos elementos. O CSS também é responsável por tornar a aplicação responsiva e amigável em diferentes dispositivos.<br></br> JavaScript: A linguagem de programação responsável pela interatividade e funcionalidade da aplicação. O JavaScript manipula o DOM para responder aos eventos de clique do usuário, alterar estilos, criar e remover elementos dinamicamente e salvar e carregar desenhos no armazenamento local.",
        "howToUse": "Ao acessar a página, o usuário é recebido com uma interface de desenho limpa e amigável. A paleta de cores é exibida na parte superior, permitindo ao usuário escolher a cor desejada para preencher os pixels. Abaixo da paleta, há botões para limpar o quadro e gerar cores aleatórias.<br></br>O quadro de pixels é exibido no centro da página, sendo gerado inicialmente com o tamanho padrão de 5x5. O usuário pode alterar o tamanho do quadro inserindo um novo valor no campo <b>Tamanho do Quadro</b> e clicando no botão <b>VQV</b>.<br></br>Para criar um desenho, basta selecionar uma cor na paleta e clicar nos pixels desejados no quadro. Os pixels preenchidos com a cor escolhida são salvos automaticamente no armazenamento local, permitindo que o usuário retome o desenho a qualquer momento.<br></br>O botão <b>Limpar</b> remove todas as cores do quadro, permitindo que o usuário comece um novo desenho sem recarregar a página.<br></br>O botão <b>Cores aleatórias</b> preenche a paleta com novas cores aleatórias, adicionando uma dose extra de diversão e criatividade ao processo de desenho.",
        "resources": "Paleta de Cores Personalizada: A aplicação apresenta uma paleta de cores com quatro opções iniciais (azul, vermelho, verde e amarelo). Os usuários podem selecionar uma cor da paleta simplesmente clicando nela. A cor selecionada será usada para preencher os pixels no quadro.<br></br>Quadro de Pixels Ajustável: Os usuários podem definir o tamanho do quadro de pixels através de um campo de entrada numérico. O tamanho mínimo é de 5x5 e o máximo é de 50x50. O quadro de pixels é gerado dinamicamente com base no valor inserido, proporcionando uma tela de desenho personalizada para cada usuário.<br></br>Limpar o Quadro: O aplicativo oferece a opção de limpar todo o quadro, restaurando-o ao estado inicial, permitindo aos usuários recomeçar o desenho a qualquer momento.<br></br>Cores Aleatórias: Além da paleta de cores fixa, o usuário pode clicar em um botão para preencher a paleta de cores com tons aleatórios. Isso permite a experimentação e a criação de desenhos mais criativos e diversificados.<br></br>Salvar e Carregar Desenhos: Os desenhos criados pelos usuários são salvos automaticamente no armazenamento local do navegador. Isso permite que o usuário retome o trabalho em um desenho anterior ao recarregar a página, garantindo que nenhum progresso seja perdido."
    },
    {
        "id": "Color Guess",
        "location": "color-guess/index.html",
        "about": "Descrição do Projeto<br></br>O projeto <b>Adivinha Cor</b> é um divertido jogo interativo desenvolvido em linguagens web padrão (HTML, CSS e JavaScript) que desafia os jogadores a identificar a cor RGB correspondente a partir de uma paleta de círculos coloridos. O objetivo é acertar a cor correta para acumular pontos e alcançar a pontuação mais alta possível.",
        "technology": "HTML: Utilizado para criar a estrutura da página, definir os elementos e contêineres para o título do jogo, a paleta de círculos coloridos, o texto de dica com o valor RGB a ser adivinhado, o placar de pontos e o botão de reiniciar.<br></br>CSS: Responsável por estilizar os elementos da página, definindo cores, tamanhos, bordas e posicionamento dos elementos. O CSS também cria a aparência visual dos círculos coloridos e do botão de reiniciar.<br></br>JavaScript: A linguagem de programação que proporciona interatividade e funcionalidade ao jogo. O JavaScript é responsável por gerar cores RGB aleatórias para os círculos coloridos, permitir ao jogador clicar nos círculos para adivinhar a cor correta, atualizar o placar de pontos e reiniciar o jogo.",
        "howToUse": "Ao carregar a página, a aplicação verifica se há uma pontuação salva no armazenamento local. Caso não exista, o placar é inicializado com zero. A paleta de círculos coloridos é criada dinamicamente, preenchendo seis círculos com cores RGB aleatórias.<br></br>O objetivo do jogo é identificar o círculo cuja cor corresponde ao valor RGB exibido acima da paleta. Quando o jogador clica em um círculo, a aplicação verifica se a cor do círculo corresponde à cor exibida. Se o jogador acertar, o placar é atualizado e a mensagem <b>Acertou!</b> é exibida. Caso contrário, a mensagem <b>Errou! Tente novamente!</b> é mostrada.<br></br>O jogo continua até que o jogador decida reiniciar clicando no botão <b>Reiniciar</b>. Ao clicar no botão, a página é recarregada, gerando novas cores RGB aleatórias na paleta e reiniciando o placar para zero.",
        "resources": "Interface Amigável: Ao acessar a aplicação, os jogadores são recebidos com uma interface simples e atraente. O título <b>Adivinha cor</b> e uma descrição orientam os jogadores sobre o objetivo do jogo.<br></br>Paleta de Círculos Coloridos: A paleta exibe seis círculos coloridos, cada um com uma cor RGB aleatória. Os jogadores devem escolher o círculo com a cor que corresponde ao valor RGB exibido acima da paleta.<br></br>Placar de Pontuação: A aplicação exibe um placar indicando a pontuação atual do jogador. Cada acerto soma 3 pontos ao placar, incentivando os jogadores a continuar tentando melhorar seu desempenho.<br></br>Reiniciar o Jogo: Um botão <b>Reiniciar</b> é fornecido para permitir que os jogadores comecem um novo jogo, restaurando a paleta de cores com novos valores RGB e reiniciando o placar para zero.<br></br>Armazenamento Local: A pontuação é armazenada localmente para que os jogadores possam acompanhar seu progresso, mesmo após recarregar a página ou fechar o navegador."

    }
]